Revit 2016 API
RevisionSettings.RevisionAlphabet Property
 Determines the sequence of characters assigned to revisions that use alphabetic numbering.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2015
Syntax
C#
[ObsoleteAttribute("This property is obsolete as of Revit 2016. Use GetAlphanumericRevisionSettings or SetAlphanumericRevisionSettings instead.")]
public string RevisionAlphabet { get; set; }
Visual Basic
<ObsoleteAttribute("This property is obsolete as of Revit 2016. Use GetAlphanumericRevisionSettings or SetAlphanumericRevisionSettings instead.")> _
Public Property RevisionAlphabet As String
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property is obsolete as of Revit 2016. Use GetAlphanumericRevisionSettings or SetAlphanumericRevisionSettings instead.")]
public:
property String^ RevisionAlphabet {
	String^ get ();
	void set (String^ value);
}
Remarks
 Individual revisions may be set to use alphabetic numbering rather than numeric. This property determines the characters assigned to the alphabetic revisions. The characters in this string will be assigned to revisions in the same order that they appear in the string. If there are more alphabetic revisions than characters in this string then subsequent alphabetic revisions will be assigned duplicated characters. For example, if the string provided were "XY", the first alphabetic revision would be shown as "X", the second as "Y", the third as "XX", then "YY", "XXX", etc.
 This string may not contain any whitespace, numeric characters, or duplicated characters. It also may not be empty.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: alphabet is an empty string. -or- When setting this property: alphabet contains one or more numeric characters. -or- When setting this property: alphabet contains one or more whitespace characters. -or- When setting this property: alphabet contains one or more duplicated characters. -or- When setting this property: Commas are not allowed in the alphanumeric revision sequence.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was NULL
Autodesk.Revit.Exceptions.InvalidOperationException |  The Alphanumeric sequence for this RevisionSettings is not compatible with the Alphabetic type. It may have items containing numbers or special characters, or it may have items more than one character in length. Call GetAlphanumericRevisionSettings to get the sequence.
See Also
RevisionSettings Class
Autodesk.Revit.DB Namespace